virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/component/matrix.h
/* -------- CCFG_SYSIO : (MATRIX Offset: 0x114) (R/W 32) System I/O Configuration Register -------- */
#define CCFG_SYSIO_SYSIO4_Pos                 _U_(4)                                               /**< (CCFG_SYSIO) PB4 or TDI Assignment Position */
#define CCFG_SYSIO_SYSIO4_Msk                 (_U_(0x1) << CCFG_SYSIO_SYSIO4_Pos)                  /**< (CCFG_SYSIO) PB4 or TDI Assignment Mask */
#define CCFG_SYSIO_SYSIO4(value)              (CCFG_SYSIO_SYSIO4_Msk & ((value) << CCFG_SYSIO_SYSIO4_Pos))
#define CCFG_SYSIO_SYSIO5_Pos                 _U_(5)                                               /**< (CCFG_SYSIO) PB5 or TDO/TRACESWO Assignment Position */
#define CCFG_SYSIO_SYSIO5_Msk                 (_U_(0x1) << CCFG_SYSIO_SYSIO5_Pos)                  /**< (CCFG_SYSIO) PB5 or TDO/TRACESWO Assignment Mask */
#define CCFG_SYSIO_SYSIO5(value)              (CCFG_SYSIO_SYSIO5_Msk & ((value) << CCFG_SYSIO_SYSIO5_Pos))
#define CCFG_SYSIO_SYSIO6_Pos                 _U_(6)                                               /**< (CCFG_SYSIO) PB6 or TMS/SWDIO Assignment Position */
#define CCFG_SYSIO_SYSIO6_Msk                 (_U_(0x1) << CCFG_SYSIO_SYSIO6_Pos)                  /**< (CCFG_SYSIO) PB6 or TMS/SWDIO Assignment Mask */
#define CCFG_SYSIO_SYSIO6(value)              (CCFG_SYSIO_SYSIO6_Msk & ((value) << CCFG_SYSIO_SYSIO6_Pos))
#define CCFG_SYSIO_SYSIO7_Pos                 _U_(7)                                               /**< (CCFG_SYSIO) PB7 or TCK/SWCLK Assignment Position */
#define CCFG_SYSIO_SYSIO7_Msk                 (_U_(0x1) << CCFG_SYSIO_SYSIO7_Pos)                  /**< (CCFG_SYSIO) PB7 or TCK/SWCLK Assignment Mask */
#define CCFG_SYSIO_SYSIO7(value)              (CCFG_SYSIO_SYSIO7_Msk & ((value) << CCFG_SYSIO_SYSIO7_Pos))
#define CCFG_SYSIO_SYSIO10_Pos                _U_(10)                                              /**< (CCFG_SYSIO) PA21 or DM Assignment Position */
#define CCFG_SYSIO_SYSIO10_Msk                (_U_(0x1) << CCFG_SYSIO_SYSIO10_Pos)                 /**< (CCFG_SYSIO) PA21 or DM Assignment Mask */
#define CCFG_SYSIO_SYSIO10(value)             (CCFG_SYSIO_SYSIO10_Msk & ((value) << CCFG_SYSIO_SYSIO10_Pos))
#define CCFG_SYSIO_SYSIO11_Pos                _U_(11)                                              /**< (CCFG_SYSIO) PA22 or DP Assignment Position */
#define CCFG_SYSIO_SYSIO11_Msk                (_U_(0x1) << CCFG_SYSIO_SYSIO11_Pos)                 /**< (CCFG_SYSIO) PA22 or DP Assignment Mask */
#define CCFG_SYSIO_SYSIO11(value)             (CCFG_SYSIO_SYSIO11_Msk & ((value) << CCFG_SYSIO_SYSIO11_Pos))
#define CCFG_SYSIO_SYSIO12_Pos                _U_(12)                                              /**< (CCFG_SYSIO) PB12 or ERASE Assignment Position */
#define CCFG_SYSIO_SYSIO12_Msk                (_U_(0x1) << CCFG_SYSIO_SYSIO12_Pos)                 /**< (CCFG_SYSIO) PB12 or ERASE Assignment Mask */
#define CCFG_SYSIO_SYSIO12(value)             (CCFG_SYSIO_SYSIO12_Msk & ((value) << CCFG_SYSIO_SYSIO12_Pos))
#define CCFG_SYSIO_Msk                        _U_(0x00001CF0)                                      /**< (CCFG_SYSIO) Register Mask  */

#define CCFG_SYSIO_SYSIO_Pos                  _U_(4)                                               /**< (CCFG_SYSIO Position) PBx2 or ERASE Assignment */
#define CCFG_SYSIO_SYSIO_Msk                  (_U_(0x7F) << CCFG_SYSIO_SYSIO_Pos)                  /**< (CCFG_SYSIO Mask) SYSIO */
#define CCFG_SYSIO_SYSIO(value)               (CCFG_SYSIO_SYSIO_Msk & ((value) << CCFG_SYSIO_SYSIO_Pos)) 

/* -------- CCFG_DYNCKG : (MATRIX Offset: 0x118) (R/W 32) Dynamic Clock Gating Register -------- */
#define CCFG_DYNCKG_MATCKG_Pos                _U_(0)                                               /**< (CCFG_DYNCKG) MATRIX Dynamic Clock Gating Position */
#define CCFG_DYNCKG_MATCKG_Msk                (_U_(0x1) << CCFG_DYNCKG_MATCKG_Pos)                 /**< (CCFG_DYNCKG) MATRIX Dynamic Clock Gating Mask */
#define CCFG_DYNCKG_MATCKG(value)             (CCFG_DYNCKG_MATCKG_Msk & ((value) << CCFG_DYNCKG_MATCKG_Pos))
#define CCFG_DYNCKG_BRIDCKG_Pos               _U_(1)                                               /**< (CCFG_DYNCKG) Bridge Dynamic Clock Gating Enable Position */
#define CCFG_DYNCKG_BRIDCKG_Msk               (_U_(0x1) << CCFG_DYNCKG_BRIDCKG_Pos)                /**< (CCFG_DYNCKG) Bridge Dynamic Clock Gating Enable Mask */
#define CCFG_DYNCKG_BRIDCKG(value)            (CCFG_DYNCKG_BRIDCKG_Msk & ((value) << CCFG_DYNCKG_BRIDCKG_Pos))
#define CCFG_DYNCKG_EFCCKG_Pos                _U_(2)                                               /**< (CCFG_DYNCKG) EFC Dynamic Clock Gating Enable Position */
#define CCFG_DYNCKG_EFCCKG_Msk                (_U_(0x1) << CCFG_DYNCKG_EFCCKG_Pos)                 /**< (CCFG_DYNCKG) EFC Dynamic Clock Gating Enable Mask */
#define CCFG_DYNCKG_EFCCKG(value)             (CCFG_DYNCKG_EFCCKG_Msk & ((value) << CCFG_DYNCKG_EFCCKG_Pos))
#define CCFG_DYNCKG_Msk                       _U_(0x00000007)                                      /**< (CCFG_DYNCKG) Register Mask  */


/* -------- CCFG_I2SCLKSEL : (MATRIX Offset: 0x11C) (R/W 32) I2S Clock Source Selection Register -------- */
#define CCFG_I2SCLKSEL_CLKSEL0_Pos            _U_(0)                                               /**< (CCFG_I2SCLKSEL) I2S0 Clock Source Position */
#define CCFG_I2SCLKSEL_CLKSEL0_Msk            (_U_(0x1) << CCFG_I2SCLKSEL_CLKSEL0_Pos)             /**< (CCFG_I2SCLKSEL) I2S0 Clock Source Mask */
#define CCFG_I2SCLKSEL_CLKSEL0(value)         (CCFG_I2SCLKSEL_CLKSEL0_Msk & ((value) << CCFG_I2SCLKSEL_CLKSEL0_Pos))
#define CCFG_I2SCLKSEL_CLKSEL1_Pos            _U_(1)                                               /**< (CCFG_I2SCLKSEL) I2S1 Clock Source Position */
#define CCFG_I2SCLKSEL_CLKSEL1_Msk            (_U_(0x1) << CCFG_I2SCLKSEL_CLKSEL1_Pos)             /**< (CCFG_I2SCLKSEL) I2S1 Clock Source Mask */
#define CCFG_I2SCLKSEL_CLKSEL1(value)         (CCFG_I2SCLKSEL_CLKSEL1_Msk & ((value) << CCFG_I2SCLKSEL_CLKSEL1_Pos))
#define CCFG_I2SCLKSEL_Msk                    _U_(0x00000003)                                      /**< (CCFG_I2SCLKSEL) Register Mask  */

