virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/component/matrix.h
#define CCFG_I2SCLKSEL_CLKSEL_Pos             _U_(0)                                               /**< (CCFG_I2SCLKSEL Position) I2Sx Clock Source */
#define CCFG_I2SCLKSEL_CLKSEL_Msk             (_U_(0x3) << CCFG_I2SCLKSEL_CLKSEL_Pos)              /**< (CCFG_I2SCLKSEL Mask) CLKSEL */
#define CCFG_I2SCLKSEL_CLKSEL(value)          (CCFG_I2SCLKSEL_CLKSEL_Msk & ((value) << CCFG_I2SCLKSEL_CLKSEL_Pos)) 

/* -------- CCFG_USBMR : (MATRIX Offset: 0x120) (R/W 32) USB Management Register -------- */
#define CCFG_USBMR_USBMODE_Pos                _U_(0)                                               /**< (CCFG_USBMR) USB Mode Selection Position */
#define CCFG_USBMR_USBMODE_Msk                (_U_(0x1) << CCFG_USBMR_USBMODE_Pos)                 /**< (CCFG_USBMR) USB Mode Selection Mask */
#define CCFG_USBMR_USBMODE(value)             (CCFG_USBMR_USBMODE_Msk & ((value) << CCFG_USBMR_USBMODE_Pos))
#define CCFG_USBMR_USBHTSSC_Pos               _U_(1)                                               /**< (CCFG_USBMR) USB Transceiver Suspend Software Control Position */
#define CCFG_USBMR_USBHTSSC_Msk               (_U_(0x1) << CCFG_USBMR_USBHTSSC_Pos)                /**< (CCFG_USBMR) USB Transceiver Suspend Software Control Mask */
#define CCFG_USBMR_USBHTSSC(value)            (CCFG_USBMR_USBHTSSC_Msk & ((value) << CCFG_USBMR_USBHTSSC_Pos))
#define CCFG_USBMR_USBHTSC_Pos                _U_(2)                                               /**< (CCFG_USBMR) USB Host Transceiver Suspend Control Position */
#define CCFG_USBMR_USBHTSC_Msk                (_U_(0x1) << CCFG_USBMR_USBHTSC_Pos)                 /**< (CCFG_USBMR) USB Host Transceiver Suspend Control Mask */
#define CCFG_USBMR_USBHTSC(value)             (CCFG_USBMR_USBHTSC_Msk & ((value) << CCFG_USBMR_USBHTSC_Pos))
#define CCFG_USBMR_Msk                        _U_(0x00000007)                                      /**< (CCFG_USBMR) Register Mask  */


/* -------- MATRIX_WPMR : (MATRIX Offset: 0x1E4) (R/W 32) Write Protection Mode Register -------- */
#define MATRIX_WPMR_WPEN_Pos                  _U_(0)                                               /**< (MATRIX_WPMR) Write Protection Enable Position */
#define MATRIX_WPMR_WPEN_Msk                  (_U_(0x1) << MATRIX_WPMR_WPEN_Pos)                   /**< (MATRIX_WPMR) Write Protection Enable Mask */
#define MATRIX_WPMR_WPEN(value)               (MATRIX_WPMR_WPEN_Msk & ((value) << MATRIX_WPMR_WPEN_Pos))
#define MATRIX_WPMR_WPKEY_Pos                 _U_(8)                                               /**< (MATRIX_WPMR) Write Protection Key Position */
#define MATRIX_WPMR_WPKEY_Msk                 (_U_(0xFFFFFF) << MATRIX_WPMR_WPKEY_Pos)             /**< (MATRIX_WPMR) Write Protection Key Mask */
#define MATRIX_WPMR_WPKEY(value)              (MATRIX_WPMR_WPKEY_Msk & ((value) << MATRIX_WPMR_WPKEY_Pos))
#define   MATRIX_WPMR_WPKEY_PASSWD_Val        _U_(0x4D4154)                                        /**< (MATRIX_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define MATRIX_WPMR_WPKEY_PASSWD              (MATRIX_WPMR_WPKEY_PASSWD_Val << MATRIX_WPMR_WPKEY_Pos) /**< (MATRIX_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define MATRIX_WPMR_Msk                       _U_(0xFFFFFF01)                                      /**< (MATRIX_WPMR) Register Mask  */


/* -------- MATRIX_WPSR : (MATRIX Offset: 0x1E8) ( R/ 32) Write Protection Status Register -------- */
#define MATRIX_WPSR_WPVS_Pos                  _U_(0)                                               /**< (MATRIX_WPSR) Write Protection Violation Status Position */
#define MATRIX_WPSR_WPVS_Msk                  (_U_(0x1) << MATRIX_WPSR_WPVS_Pos)                   /**< (MATRIX_WPSR) Write Protection Violation Status Mask */
#define MATRIX_WPSR_WPVS(value)               (MATRIX_WPSR_WPVS_Msk & ((value) << MATRIX_WPSR_WPVS_Pos))
#define MATRIX_WPSR_WPVSRC_Pos                _U_(8)                                               /**< (MATRIX_WPSR) Write Protection Violation Source Position */
#define MATRIX_WPSR_WPVSRC_Msk                (_U_(0xFFFF) << MATRIX_WPSR_WPVSRC_Pos)              /**< (MATRIX_WPSR) Write Protection Violation Source Mask */
#define MATRIX_WPSR_WPVSRC(value)             (MATRIX_WPSR_WPVSRC_Msk & ((value) << MATRIX_WPSR_WPVSRC_Pos))
#define MATRIX_WPSR_Msk                       _U_(0x00FFFF01)                                      /**< (MATRIX_WPSR) Register Mask  */


/** \brief MATRIX register offsets definitions */
#define MATRIX_MCFG_REG_OFST           (0x00)              /**< (MATRIX_MCFG) Master Configuration Register 0 Offset */
#define MATRIX_MCFG0_REG_OFST          (0x00)              /**< (MATRIX_MCFG0) Master Configuration Register 0 Offset */
#define MATRIX_MCFG1_REG_OFST          (0x04)              /**< (MATRIX_MCFG1) Master Configuration Register 0 Offset */
#define MATRIX_MCFG2_REG_OFST          (0x08)              /**< (MATRIX_MCFG2) Master Configuration Register 0 Offset */
#define MATRIX_SCFG_REG_OFST           (0x40)              /**< (MATRIX_SCFG) Slave Configuration Register 0 Offset */
#define MATRIX_SCFG0_REG_OFST          (0x40)              /**< (MATRIX_SCFG0) Slave Configuration Register 0 Offset */
#define MATRIX_SCFG1_REG_OFST          (0x44)              /**< (MATRIX_SCFG1) Slave Configuration Register 0 Offset */
#define MATRIX_SCFG2_REG_OFST          (0x48)              /**< (MATRIX_SCFG2) Slave Configuration Register 0 Offset */
#define MATRIX_SCFG3_REG_OFST          (0x4C)              /**< (MATRIX_SCFG3) Slave Configuration Register 0 Offset */
#define MATRIX_PRAS0_REG_OFST          (0x80)              /**< (MATRIX_PRAS0) Priority Register A for Slave 0 Offset */
#define MATRIX_PRAS1_REG_OFST          (0x88)              /**< (MATRIX_PRAS1) Priority Register A for Slave 1 Offset */
#define MATRIX_PRAS2_REG_OFST          (0x90)              /**< (MATRIX_PRAS2) Priority Register A for Slave 2 Offset */
#define MATRIX_PRAS3_REG_OFST          (0x98)              /**< (MATRIX_PRAS3) Priority Register A for Slave 3 Offset */
#define CCFG_SYSIO_REG_OFST            (0x114)             /**< (CCFG_SYSIO) System I/O Configuration Register Offset */
#define CCFG_DYNCKG_REG_OFST           (0x118)             /**< (CCFG_DYNCKG) Dynamic Clock Gating Register Offset */
#define CCFG_I2SCLKSEL_REG_OFST        (0x11C)             /**< (CCFG_I2SCLKSEL) I2S Clock Source Selection Register Offset */
#define CCFG_USBMR_REG_OFST            (0x120)             /**< (CCFG_USBMR) USB Management Register Offset */
#define MATRIX_WPMR_REG_OFST           (0x1E4)             /**< (MATRIX_WPMR) Write Protection Mode Register Offset */
#define MATRIX_WPSR_REG_OFST           (0x1E8)             /**< (MATRIX_WPSR) Write Protection Status Register Offset */

